<a href="https://colab.research.google.com/github/Praxis-QR/RDWH/blob/main/Public_MySQL_Server_in_Google_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://github.com/Praxis-QR/RDWH/raw/main/images/YantraJaalBanner.png)<br>


<hr>

[Prithwis Mukerjee](http://www.linkedin.com/in/prithwis)<br>

#Goal
In this Notebook, we install a MySQL Database on the Google Colab Platform and then make it visible to in the public internet using NGROK Tunnels

#Create Local MySQL Database

## Install MySQL

In [1]:
!apt update > /dev/null
!apt install -y  mysql-server > /dev/null
!/etc/init.d/mysql restart
!mysql --version
!mysql -e 'create database praxisDB'
#!mysql -e 'show databases'

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.


WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
su: warning: cannot change directory to /nonexistent: No such file or directory
   ...done.
mysql  Ver 8.0.34-0ubuntu0.22.04.1 for Linux on x86_64 ((Ubuntu))

## Pythons Functions for MySQL Access

In [2]:
!apt install libmysqlclient-dev > /dev/null
!pip install mysqlclient > /dev/null
import pandas as pd
import MySQLdb
from sqlalchemy import create_engine, text

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

In [3]:
#To run any non-SELECT SQL command
def runCMD (engine, DDL):
    DBConn = engine.connect()
    retcode = DBConn.execute(text(DDL))
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (engine, CMD):
    DBConn = engine.connect()
    df_mysql = pd.read_sql(text(CMD), con=DBConn)
    DBConn.close()
    return df_mysql

## Testing Local Access

In [4]:
connect_string = 'mysql://root@localhost/praxisDB'
local_engine = create_engine(connect_string)

In [5]:
DBConn = local_engine.connect()
cursor = DBConn.execute(text("SELECT VERSION()"))

# Fetch a single row using fetchone() method.
data = cursor.fetchone()
print ("Database version ", data)
# disconnect from server
DBConn.close()

Database version  ('8.0.34-0ubuntu0.22.04.1',)

In [6]:
# Create and load Emp table
# -----------------------------
runCMD(local_engine,"DROP TABLE IF EXISTS Emp;")
# -----------------------------
runCMD(local_engine,"CREATE TABLE IF NOT EXISTS Emp (\
  EmpID char(6)  NOT NULL,\
  LastName varchar(50),\
  FirstName varchar(50),\
  JobDesc varchar(50),\
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
# -----------------------------
runCMD(local_engine,"INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

In [7]:
# Create and load DEPT table
# --------------------------------
runCMD(local_engine,"DROP TABLE IF EXISTS Dept;")
# --------------------------------
runCMD(local_engine,"CREATE TABLE Dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
# --------------------------------
runCMD(local_engine,"INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

In [8]:
# Check the data
# -------------------------------
runSELECT(local_engine,"select * from Emp, Dept where Emp.DeptID = Dept.DeptID")

,EmpID,LastName,FirstName,JobDesc,JoinDate,Salary,Comm,DeptID,DeptID,DeptName,ManagerID,Location
0,742866,Bacchan,Amitabh,Executive,2003-03-10,50000,0.10,10,10,Corporate,299034,Calcutta
1,349870,Mukherjee,Rani,Manager,2005-05-04,25000,0.06,40,40,Production,349870,Bombay
2,865477,Dikshit,Madhuri,Clerk,2002-04-04,10000,0.02,20,20,Sales,239456,Calcutta
3,239456,Khan,Shahrukh,Manager,2004-01-03,30000,0.07,20,20,Sales,239456,Calcutta
4,897889,Sehwag,Virender,Cus_Rep,2005-01-02,15000,0.05,20,20,Sales,239456,Calcutta
5,123980,Dhoni,Mahender,Clerk,2004-10-09,9000,0.02,40,40,Production,349870,Bombay
6,822134,Dravid,Rahul,Sr Manager,2000-06-04,40000,0.08,30,30,Accounts,822134,Calcutta
7,997445,Dalmia,Jagmohan,Clerk,2001-07-01,12000,0.02,30,30,Accounts,822134,Calcutta
8,989007,Ganguly,Sourav,Cus_Rep,2002-01-01,20000,0.03,40,40,Production,349870,Bombay
9,299034,Ganesan,Rekha,Director,2002-10-10,60000,0.11,10,10,Corporate,299034,Calcutta
10,546223,Karthikeyan,Narayan,Secretary,2005-12-04,40000,0.09,10,10,Corporate,299034,Calcutta
11,223112,Mirza,Sania,Cus_Rep,2001-11-19,25000,0.04,30,30,Accounts,822134,Calcutta

#Modifications for Remote Access <br>
https://phoenixnap.com/kb/mysql-remote-connection <br>
https://www.techrepublic.com/article/create-mysql-8-database-user-remote-access-databases/

## Modify mysqld.cnf file

In [9]:
# Here is the original mysqld.cnf file
#!cat /etc/mysql/mysql.conf.d/mysqld.cnf

In [10]:
# This one line needs to be changed
!sed 's/bind-address		= 127.0.0.1/bind-address		= 0.0.0.0/g' /etc/mysql/mysql.conf.d/mysqld.cnf > mysqld_mod.cnf

In [11]:
#!cat /etc/mysql/mysql.conf.d/mysqld.cnf

In [12]:
!cp /content/mysqld_mod.cnf /etc/mysql/mysql.conf.d/mysqld.cnf
!/etc/init.d/mysql restart
#!mysql -e 'show databases'

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
su: warning: cannot change directory to /nonexistent: No such file or directory
   ...done.

## Creating Multiple Remote Users, Passwords, Databases

In [14]:
# IF this command fails once, try once again
#
for userID in range(10,12):
    print(userID)
    cDBCmd = "create database db4user"+str(userID)
    cUserCmd = "create user 'rUser"+str(userID)+"'@'%' identified by 'pw4rUser"+str(userID)+"';"
    grantCmd = "grant all on db4user"+str(userID)+".* to 'rUser"+str(userID)+"'@'%';"
    print(cDBCmd)
    print(cUserCmd)
    print(grantCmd)
    runCMD(local_engine,cDBCmd)
    runCMD(local_engine, cUserCmd)
    runCMD(local_engine, grantCmd)

10
create database db4user10
create user 'rUser10'@'%' identified by 'pw4rUser10';
grant all on db4user10.* to 'rUser10'@'%';
11
create database db4user11
create user 'rUser11'@'%' identified by 'pw4rUser11';
grant all on db4user11.* to 'rUser11'@'%';

In [15]:
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| db4user10          |
| db4user11          |
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

In [16]:
!mysql -e 'SELECT user FROM mysql.user;'

+------------------+
| user             |
+------------------+
| rUser10          |
| rUser11          |
| debian-sys-maint |
| mysql.infoschema |
| mysql.session    |
| mysql.sys        |
| root             |
+------------------+

# Setting up Tunnel
https://danielmiessler.com/study/ngrok/

In [17]:
from google.colab import drive
drive.mount('/content/drive')

!cp /content/drive/'My Drive'/Praxis/WebCredentials/ngrokToken.py .
# credential file for Prithwis Mukerjee
# this file needs to be uploaded into the VM

from ngrokToken import ngrokToken

#for the sake of privacy
#the following credentials need to be stored in a text file called ngrokToken.py
#in the format given below
#in the Colab VM

#otherwise, the values can be directly placed here

#ngrokToken = 'xxxxxxxxxxxxxxx'   # uncomment this line and place your own credentials here
#token is available at https://dashboard.ngrok.com/get-started/setup


#print(ngrokToken)
ngrokTokenCmd = 'ngrok authtoken '+ngrokToken

Mounted at /content/drive

### ngrok wrapper

In [18]:
!pip -q install pyngrok

from pyngrok import ngrok
# you may place the token directly here
#!ngrok authtoken xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
get_ipython().system_raw(ngrokTokenCmd)

# Open a HTTP tunnel on the default port 80
#public_url = ngrok.connect(port = '4050')
#public_url = ngrok.connect(3306)

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 681.2/681.2 kB 7.3 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
  Building wheel for pyngrok (setup.py) ... done

In [19]:
tcp_tunnel = ngrok.connect(3306, "tcp")
tcp_tunnel

WARNING:pyngrok.process.ngrok:t=2023-09-02T05:01:44+0000 lvl=warn msg="ngrok config file found at legacy location, move to XDG location" xdg_path=/root/.config/ngrok/ngrok.yml legacy_path=/root/.ngrok2/ngrok.yml

In [20]:
!curl -s http://localhost:4040/api/tunnels

{"tunnels":[{"name":"tcp-3306-2d9834d1-323a-4796-ba07-3dd4e31ee77b","ID":"73f35131913d86b4ba277023884b8e2a","uri":"/api/tunnels/tcp-3306-2d9834d1-323a-4796-ba07-3dd4e31ee77b","public_url":"tcp://0.tcp.ngrok.io:11657","proto":"tcp","config":{"addr":"localhost:3306","inspect":false},"metrics":{"conns":{"count":0,"gauge":0,"rate1":0,"rate5":0,"rate15":0,"p50":0,"p90":0,"p95":0,"p99":0},"http":{"count":0,"rate1":0,"rate5":0,"rate15":0,"p50":0,"p90":0,"p95":0,"p99":0}}}],"uri":"/api/tunnels"}

In [57]:
ngrok.disconnect('tcp://4.tcp.ngrok.io:19891')

## Connecting Remotely through Tunnel

In [24]:
# Use hostname, port from ngrok output
#
remote_connect_string = 'mysql://'+'rUser10'+':'+'pw4rUser10'+'@'+'0.tcp.ngrok.io:11657'+'/'+'db4user10'
print(remote_connect_string)
DBConn = remote_engine.connect()
cursor = DBConn.execute(text("SELECT VERSION()"))

# Fetch a single row using fetchone() method.
data = cursor.fetchone()
print ("Database version ", data)
# disconnect from server
DBConn.close()

mysql://rUser10:pw4rUser10@0.tcp.ngrok.io:11657/db4user10
Database version  ('8.0.34-0ubuntu0.22.04.1',)

#Remote Access

In [23]:
# Use hostname, port from ngrok output
#
remote_connect_string = 'mysql://'+'rUser10'+':'+'pw4rUser10'+'@'+'0.tcp.ngrok.io:11657'+'/'+'db4user10'
remote_engine = create_engine(remote_connect_string)
DBConn = remote_engine.connect()

In [25]:
# Create and load Emp table
# -----------------------------
runCMD(remote_engine,"DROP TABLE IF EXISTS Emp;")
# -----------------------------
runCMD(remote_engine,"CREATE TABLE IF NOT EXISTS Emp (\
  EmpID char(6)  NOT NULL,\
  LastName varchar(50),\
  FirstName varchar(50),\
  JobDesc varchar(50),\
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
# -----------------------------
runCMD(remote_engine,"INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

In [26]:
# Create and load DEPT table
# --------------------------------
runCMD(remote_engine,"DROP TABLE IF EXISTS Dept;")
# --------------------------------
runCMD(remote_engine,"CREATE TABLE Dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
# --------------------------------
runCMD(remote_engine,"INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

In [27]:
# Check the data
# -------------------------------
runSELECT(remote_engine,"select * from Emp, Dept where Emp.DeptID = Dept.DeptID")

,EmpID,LastName,FirstName,JobDesc,JoinDate,Salary,Comm,DeptID,DeptID,DeptName,ManagerID,Location
0,742866,Bacchan,Amitabh,Executive,2003-03-10,50000,0.10,10,10,Corporate,299034,Calcutta
1,349870,Mukherjee,Rani,Manager,2005-05-04,25000,0.06,40,40,Production,349870,Bombay
2,865477,Dikshit,Madhuri,Clerk,2002-04-04,10000,0.02,20,20,Sales,239456,Calcutta
3,239456,Khan,Shahrukh,Manager,2004-01-03,30000,0.07,20,20,Sales,239456,Calcutta
4,897889,Sehwag,Virender,Cus_Rep,2005-01-02,15000,0.05,20,20,Sales,239456,Calcutta
5,123980,Dhoni,Mahender,Clerk,2004-10-09,9000,0.02,40,40,Production,349870,Bombay
6,822134,Dravid,Rahul,Sr Manager,2000-06-04,40000,0.08,30,30,Accounts,822134,Calcutta
7,997445,Dalmia,Jagmohan,Clerk,2001-07-01,12000,0.02,30,30,Accounts,822134,Calcutta
8,989007,Ganguly,Sourav,Cus_Rep,2002-01-01,20000,0.03,40,40,Production,349870,Bombay
9,299034,Ganesan,Rekha,Director,2002-10-10,60000,0.11,10,10,Corporate,299034,Calcutta
10,546223,Karthikeyan,Narayan,Secretary,2005-12-04,40000,0.09,10,10,Corporate,299034,Calcutta
11,223112,Mirza,Sania,Cus_Rep,2001-11-19,25000,0.04,30,30,Accounts,822134,Calcutta

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself.
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)